Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Saheeh International.tmx
Source language: ar
Languages: en

source: ويرزقه من حيث لا يحتسب ومن يتوكل على الله فهو حسبه إن الله بالغ أمره قد جعل الله لكل شيء قدرا
en: And will provide for him from where he does not expect. And whoever relies upon Allah - then He is sufficient for him. Indeed, Allah will accomplish His purpose. Allah has already set for everything a [decreed] extent.

source: واللائي يئسن من المحيض من نسائكم إن ارتبتم فعدتهن ثلاثة أشهر واللائي لم يحضن وأولات الأحمال أجلهن أن يضعن حملهن ومن يتق الله يجعل له من أمره يسرا
en: And those who no longer expect menstruation among your women - if you doubt, then their period is three months, and [also for] those who have not menstruated. And for those who are pregnant, their term is until they give birth. And whoever fears Allah - He will make for him of his matter ease.

source: ذلك أمر الله أنزله إليكم ومن يتق الله يكفر عنه سيئاته ويعظم له أجرا
en: That is the command of Allah, which He has sent down to you; and whoever fears Allah - He will remove for him his misdeeds and make great for him his reward.

source: أسكنوهن من حيث سكنتم من وجدكم ولا تضاروهن لتضيقوا عليهن وإن كن أولات حمل فأنفقوا عليهن حتى يضعن حملهن فإن أرضعن لكم فآتوهن أجورهن وأتمروا بينكم بمعروف وإن تعاسرتم فسترضع له أخرى
en: Lodge them [in a section] of where you dwell out of your means and do not harm them in order to oppress them. And if they should be pregnant, then spend on them until they give birth. And if they breastfeed for you, then give them their payment and confer among yourselves in the acceptable way; but if you are in discord, then there may breastfeed for the father another woman.

source: لينفق ذو سعة من سعته ومن قدر عليه رزقه فلينفق مما آتاه الله لا يكلف الله نفسا إلا ما آتاها سيجعل الله بعد عسر يسرا
en: Let a man of wealth spend from his wealth, and he whose provision is restricted - let him spend from what Allah has given him. Allah does not charge a soul except [according to] what He has given it. Allah will bring about, after hardship, ease.

source: وكأين من قرية عتت عن أمر ربها ورسله فحاسبناها حسابا شديدا وعذبناها عذابا نكرا
en: And how many a city was insolent toward the command of its Lord and His messengers, so We took it to severe account and punished it with a terrible punishment.

source: فذاقت وبال أمرها وكان عاقبة أمرها خسرا
en: And it tasted the bad consequence of its affair, and the outcome of its affair was loss.

source: أعد الله لهم عذابا شديدا فاتقوا الله يا أولي الألباب الذين آمنوا قد أنزل الله إليكم ذكرا
en: Allah has prepared for them a severe punishment; so fear Allah, O you of understanding who have believed. Allah has sent down to you the Qur'an.

source: رسولا يتلو عليكم آيات الله مبينات ليخرج الذين آمنوا وعملوا الصالحات من الظلمات إلى النور ومن يؤمن بالله ويعمل صالحا يدخله جنات تجري من تحتها الأنهار خالدين فيها أبدا قد أحسن الله له رزقا
en: [He sent] a Messenger [Muhammad] reciting to you the distinct verses of Allah that He may bring out those who believe and do righteous deeds from darknesses into the light. And whoever believes in Allah and does righteousness - He will admit him into gardens beneath which rivers flow to abide therein forever. Allah will have perfected for him a provision.

source: الله الذي خلق سبع سماوات ومن الأرض مثلهن يتنزل الأمر بينهن لتعلموا أن الله على كل شيء قدير وأن الله قد أحاط بكل شيء علما
en: It is Allah who has created seven heavens and of the earth, the like of them. [His] command descends among them so you may know that Allah is over all things competent and that Allah has encompassed all things in knowledge.

source: يا أيها النبي لم تحرم ما أحل الله لك تبتغي مرضات أزواجك والله غفور رحيم
en: O Prophet, why do you prohibit [yourself from] what Allah has made lawful for you, seeking the approval of your wives? And Allah is Forgiving and Merciful.

source: قد فرض الله لكم تحلة أيمانكم والله مولاكم وهو العليم الحكيم
en: Allah has already ordained for you [Muslims] the dissolution of your oaths. And Allah is your protector, and He is the Knowing, the Wise.

source: وإذ أسر النبي إلى بعض أزواجه حديثا فلما نبأت به وأظهره الله عليه عرف بعضه وأعرض عن بعض فلما نبأها به قالت من أنبأك هذا قال نبأني العليم الخبير
en: And [remember] when the Prophet confided to one of his wives a statement; and when she informed [another] of it and Allah showed it to him, he made known part of it and ignored a part. And when he informed her about it, she said, "Who told you this?" He said, "I was informed by the Knowing, the Acquainted."

source: إن تتوبا إلى الله فقد صغت قلوبكما وإن تظاهرا عليه فإن الله هو مولاه وجبريل وصالح المؤمنين والملائكة بعد ذلك ظهير
en: If you two [wives] repent to Allah, [it is best], for your hearts have deviated. But if you cooperate against him - then indeed Allah is his protector, and Gabriel and the righteous of the believers and the angels, moreover, are [his] assistants.

source: عسى ربه إن طلقكن أن يبدله أزواجا خيرا منكن مسلمات مؤمنات قانتات تائبات عابدات سائحات ثيبات وأبكارا
en: Perhaps his Lord, if he divorced you [all], would substitute for him wives better than you - submitting [to Allah], believing, devoutly obedient, repentant, worshipping, and traveling - [ones] previously married and virgins.

source: يا أيها الذين آمنوا قوا أنفسكم وأهليكم نارا وقودها الناس والحجارة عليها ملائكة غلاظ شداد لا يعصون الله ما أمرهم ويفعلون ما يؤمرون
en: O you who have believed, protect yourselves and your families from a Fire whose fuel is people and stones, over which are [appointed] angels, harsh and severe; they do not disobey Allah in what He commands them but do what they are commanded.

source: يا أيها الذين كفروا لا تعتذروا اليوم إنما تجزون ما كنتم تعملون
en: O you who have disbelieved, make no excuses that Day. You will only be recompensed for what you used to do.

source: يا أيها الذين آمنوا توبوا إلى الله توبة نصوحا عسى ربكم أن يكفر عنكم سيئاتكم ويدخلكم جنات تجري من تحتها الأنهار يوم لا يخزي الله النبي والذين آمنوا معه نورهم يسعى بين أيديهم وبأيمانهم يقولون ربنا أتمم لنا نورنا واغفر لنا إنك على كل شيء قدير
en: O you who have believed, repent to Allah with sincere repentance. Perhaps your Lord will remove from you your misdeeds and admit you into gardens beneath which rivers flow [on] the Day when Allah will not disgrace the Prophet and those who believed with him. Their light will proceed before them and on their right; they will say, "Our Lord, perfect for us our light and forgive us. Indeed, You are over all things competent."

source: ضرب الله مثلا للذين كفروا امرأت نوح وامرأت لوط كانتا تحت عبدين من عبادنا صالحين فخانتاهما فلم يغنيا عنهما من الله شيئا وقيل ادخلا النار مع الداخلين
en: Allah presents an example of those who disbelieved: the wife of Noah and the wife of Lot. They were under two of Our righteous servants but betrayed them, so those prophets did not avail them from Allah at all, and it was said, "Enter the Fire with those who enter."

source: وضرب الله مثلا للذين آمنوا امرأت فرعون إذ قالت رب ابن لي عندك بيتا في الجنة ونجني من فرعون وعمله ونجني من القوم الظالمين
en: And Allah presents an example of those who believed: the wife of Pharaoh, when she said, "My Lord, build for me near You a house in Paradise and save me from Pharaoh and his deeds and save me from the wrongdoing people."

source: ومريم ابنت عمران التي أحصنت فرجها فنفخنا فيه من روحنا وصدقت بكلمات ربها وكتبه وكانت من القانتين
en: And [the example of] Mary, the daughter of 'Imran, who guarded her chastity, so We blew into [her garment] through Our angel, and she believed in the words of her Lord and His scriptures and was of the devoutly obedient.

source: تبارك الذي بيده الملك وهو على كل شيء قدير
en: Blessed is He in whose hand is dominion, and He is over all things competent -

source: الذي خلق الموت والحياة ليبلوكم أيكم أحسن عملا وهو العزيز الغفور
en: [He] who created death and life to test you [as to] which of you is best in deed - and He is the Exalted in Might, the Forgiving -

source: الذي خلق سبع سماوات طباقا ما ترى في خلق الرحمن من تفاوت فارجع البصر هل ترى من فطور
en: [And] who created seven heavens in layers. You do not see in the creation of the Most Merciful any inconsistency. So return [your] vision [to the sky]; do you see any breaks?

source: ثم ارجع البصر كرتين ينقلب إليك البصر خاسئا وهو حسير
en: Then return [your] vision twice again. [Your] vision will return to you humbled while it is fatigued.

source: ولقد زينا السماء الدنيا بمصابيح وجعلناها رجوما للشياطين وأعتدنا لهم عذاب السعير
en: And We have certainly beautified the nearest heaven with stars and have made [from] them what is thrown at the devils and have prepared for them the punishment of the Blaze.

source: وللذين كفروا بربهم عذاب جهنم وبئس المصير
en: And for those who disbelieved in their Lord is the punishment of Hell, and wretched is the destination.

source: إذا ألقوا فيها سمعوا لها شهيقا وهي تفور
en: When they are thrown into it, they hear from it a [dreadful] inhaling while it boils up.

source: تكاد تميز من الغيظ كلما ألقي فيها فوج سألهم خزنتها ألم يأتكم نذير
en: It almost bursts with rage. Every time a company is thrown into it, its keepers ask them, "Did there not come to you a warner?"

source: قالوا بلى قد جاءنا نذير فكذبنا وقلنا ما نزل الله من شيء إن أنتم إلا في ضلال كبير
en: They will say," Yes, a warner had come to us, but we denied and said, 'Allah has not sent down anything. You are not but in great error.'"

source: وقالوا لو كنا نسمع أو نعقل ما كنا في أصحاب السعير
en: And they will say, "If only we had been listening or reasoning, we would not be among the companions of the Blaze."

source: فاعترفوا بذنبهم فسحقا لأصحاب السعير
en: And they will admit their sin, so [it is] alienation for the companions of the Blaze.

source: إن الذين يخشون ربهم بالغيب لهم مغفرة وأجر كبير
en: Indeed, those who fear their Lord unseen will have forgiveness and great reward.

source: وأسروا قولكم أو اجهروا به إنه عليم بذات الصدور
en: And conceal your speech or publicize it; indeed, He is Knowing of that within the breasts.

source: ألا يعلم من خلق وهو اللطيف الخبير
en: Does He who created not know, while He is the Subtle, the Acquainted?

source: هو الذي جعل لكم الأرض ذلولا فامشوا في مناكبها وكلوا من رزقه وإليه النشور
en: It is He who made the earth tame for you - so walk among its slopes and eat of His provision - and to Him is the resurrection.

source: أأمنتم من في السماء أن يخسف بكم الأرض فإذا هي تمور
en: Do you feel secure that He who [holds authority] in the heaven would not cause the earth to swallow you and suddenly it would sway?

source: أم أمنتم من في السماء أن يرسل عليكم حاصبا فستعلمون كيف نذير
en: Or do you feel secure that He who [holds authority] in the heaven would not send against you a storm of stones? Then you would know how [severe] was My warning.

source: ولقد كذب الذين من قبلهم فكيف كان نكير
en: And already had those before them denied, and how [terrible] was My reproach.

source: أولم يروا إلى الطير فوقهم صافات ويقبضن ما يمسكهن إلا الرحمن إنه بكل شيء بصير
en: Do they not see the birds above them with wings outspread and [sometimes] folded in? None holds them [aloft] except the Most Merciful. Indeed He is, of all things, Seeing.

source: أمن هذا الذي هو جند لكم ينصركم من دون الرحمن إن الكافرون إلا في غرور
en: Or who is it that could be an army for you to aid you other than the Most Merciful? The disbelievers are not but in delusion.

source: أمن هذا الذي يرزقكم إن أمسك رزقه بل لجوا في عتو ونفور
en: Or who is it that could provide for you if He withheld His provision? But they have persisted in insolence and aversion.

source: أفمن يمشي مكبا على وجهه أهدى أمن يمشي سويا على صراط مستقيم
en: Then is one who walks fallen on his face better guided or one who walks erect on a straight path?

source: قل هو الذي أنشأكم وجعل لكم السمع والأبصار والأفئدة قليلا ما تشكرون
en: Say, "It is He who has produced you and made for you hearing and vision and hearts; little are you grateful."

source: قل هو الذي ذرأكم في الأرض وإليه تحشرون
en: Say, "It is He who has multiplied you throughout the earth, and to Him you will be gathered."

source: قل إنما العلم عند الله وإنما أنا نذير مبين
en: Say, "The knowledge is only with Allah, and I am only a clear warner."

source: فلما رأوه زلفة سيئت وجوه الذين كفروا وقيل هذا الذي كنتم به تدعون
en: But when they see it approaching, the faces of those who disbelieve will be distressed, and it will be said, "This is that for which you used to call."

source: قل أرأيتم إن أهلكني الله ومن معي أو رحمنا فمن يجير الكافرين من عذاب أليم
en: Say, [O Muhammad], "Have you considered: whether Allah should cause my death and those with me or have mercy upon us, who can protect the disbelievers from a painful punishment?"

source: قل هو الرحمن آمنا به وعليه توكلنا فستعلمون من هو في ضلال مبين
en: Say, "He is the Most Merciful; we have believed in Him, and upon Him we have relied. And you will [come to] know who it is that is in clear error."

source: قل أرأيتم إن أصبح ماؤكم غورا فمن يأتيكم بماء معين
en: Say, "Have you considered: if your water was to become sunken [into the earth], then who could bring you flowing water?"

source: ن والقلم وما يسطرون
en: Nun. By the pen and what they inscribe,

source: ما أنت بنعمة ربك بمجنون
en: You are not, [O Muhammad], by the favor of your Lord, a madman.

source: وإن لك لأجرا غير ممنون
en: And indeed, for you is a reward uninterrupted.

source: وإنك لعلى خلق عظيم
en: And indeed, you are of a great moral character.

source: فستبصر ويبصرون
en: So you will see and they will see

source: بأييكم المفتون
en: Which of you is the afflicted [by a devil].

source: إن ربك هو أعلم بمن ضل عن سبيله وهو أعلم بالمهتدين
en: Indeed, your Lord is most knowing of who has gone astray from His way, and He is most knowing of the [rightly] guided.

source: فلا تطع المكذبين
en: Then do not obey the deniers.

source: ودوا لو تدهن فيدهنون
en: They wish that you would soften [in your position], so they would soften [toward you].

source: ولا تطع كل حلاف مهين
en: And do not obey every worthless habitual swearer

source: هماز مشاء بنميم
en: [And] scorner, going about with malicious gossip -

source: مناع للخير معتد أثيم
en: A preventer of good, transgressing and sinful,

source: عتل بعد ذلك زنيم
en: Cruel, moreover, and an illegitimate pretender.

source: أن كان ذا مال وبنين
en: Because he is a possessor of wealth and children,

source: إذا تتلى عليه آياتنا قال أساطير الأولين
en: When Our verses are recited to him, he says, "Legends of the former peoples."

source: سنسمه على الخرطوم
en: We will brand him upon the snout.

source: إنا بلوناهم كما بلونا أصحاب الجنة إذ أقسموا ليصرمنها مصبحين
en: Indeed, We have tried them as We tried the companions of the garden, when they swore to cut its fruit in the [early] morning

source: ولا يستثنون
en: Without making exception.

source: فطاف عليها طائف من ربك وهم نائمون
en: So there came upon the garden an affliction from your Lord while they were asleep.

source: فأصبحت كالصريم
en: And it became as though reaped.

source: فتنادوا مصبحين
en: And they called one another at morning,

source: أن اغدوا على حرثكم إن كنتم صارمين
en: [Saying], "Go early to your crop if you would cut the fruit."

source: فانطلقوا وهم يتخافتون
en: So they set out, while lowering their voices,

source: أن لا يدخلنها اليوم عليكم مسكين
en: [Saying], "There will surely not enter it today upon you [any] poor person."

source: وغدوا على حرد قادرين
en: And they went early in determination, [assuming themselves] able.

source: فلما رأوها قالوا إنا لضالون
en: But when they saw it, they said, "Indeed, we are lost;

source: قال أوسطهم ألم أقل لكم لولا تسبحون
en: The most moderate of them said, "Did I not say to you, 'Why do you not exalt [Allah]?' "

source: قالوا سبحان ربنا إنا كنا ظالمين
en: They said, "Exalted is our Lord! Indeed, we were wrongdoers."

source: فأقبل بعضهم على بعض يتلاومون
en: Then they approached one another, blaming each other.

source: قالوا يا ويلنا إنا كنا طاغين
en: They said, "O woe to us; indeed we were transgressors.

source: عسى ربنا أن يبدلنا خيرا منها إنا إلى ربنا راغبون
en: Perhaps our Lord will substitute for us [one] better than it. Indeed, we are toward our Lord desirous."

source: كذلك العذاب ولعذاب الآخرة أكبر لو كانوا يعلمون
en: Such is the punishment [of this world]. And the punishment of the Hereafter is greater, if they only knew.

source: إن للمتقين عند ربهم جنات النعيم
en: Indeed, for the righteous with their Lord are the Gardens of Pleasure.

source: أفنجعل المسلمين كالمجرمين
en: Then will We treat the Muslims like the criminals?

source: أم لكم كتاب فيه تدرسون
en: Or do you have a scripture in which you learn

source: إن لكم فيه لما تخيرون
en: That indeed for you is whatever you choose?

source: أم لكم أيمان علينا بالغة إلى يوم القيامة إن لكم لما تحكمون
en: Or do you have oaths [binding] upon Us, extending until the Day of Resurrection, that indeed for you is whatever you judge?

source: سلهم أيهم بذلك زعيم
en: Ask them which of them, for that [claim], is responsible.

source: أم لهم شركاء فليأتوا بشركائهم إن كانوا صادقين
en: Or do they have partners? Then let them bring their partners, if they should be truthful.

source: يوم يكشف عن ساق ويدعون إلى السجود فلا يستطيعون
en: The Day the shin will be uncovered and they are invited to prostration but the disbelievers will not be able,

source: خاشعة أبصارهم ترهقهم ذلة وقد كانوا يدعون إلى السجود وهم سالمون
en: Their eyes humbled, humiliation will cover them. And they used to be invited to prostration while they were sound.

source: فذرني ومن يكذب بهذا الحديث سنستدرجهم من حيث لا يعلمون
en: So leave Me, [O Muhammad], with [the matter of] whoever denies the Qur'an. We will progressively lead them [to punishment] from where they do not know.

source: فاصبر لحكم ربك ولا تكن كصاحب الحوت إذ نادى وهو مكظوم
en: Then be patient for the decision of your Lord, [O Muhammad], and be not like the companion of the fish when he called out while he was distressed.

source: لولا أن تداركه نعمة من ربه لنبذ بالعراء وهو مذموم
en: If not that a favor from his Lord overtook him, he would have been thrown onto the naked shore while he was censured.

source: فاجتباه ربه فجعله من الصالحين
en: And his Lord chose him and made him of the righteous.

source: وإن يكاد الذين كفروا ليزلقونك بأبصارهم لما سمعوا الذكر ويقولون إنه لمجنون
en: And indeed, those who disbelieve would almost make you slip with their eyes when they hear the message, and they say, "Indeed, he is mad."

source: وما هو إلا ذكر للعالمين
en: But it is not except a reminder to the worlds.

source: الحاقة
en: The Inevitable Reality -

source: ما الحاقة
en: What is the Inevitable Reality?

source: وما أدراك ما الحاقة
en: And what can make you know what is the Inevitable Reality?

source: كذبت ثمود وعاد بالقارعة
en: Thamud and 'Aad denied the Striking Calamity.

source: فأما ثمود فأهلكوا بالطاغية
en: So as for Thamud, they were destroyed by the overpowering [blast].

source: وأما عاد فأهلكوا بريح صرصر عاتية
en: And as for 'Aad, they were destroyed by a screaming, violent wind

source: سخرها عليهم سبع ليال وثمانية أيام حسوما فترى القوم فيها صرعى كأنهم أعجاز نخل خاوية
en: Which Allah imposed upon them for seven nights and eight days in succession, so you would see the people therein fallen as if they were hollow trunks of palm trees.

source: فهل ترى لهم من باقية
en: Then do you see of them any remains?

source: وجاء فرعون ومن قبله والمؤتفكات بالخاطئة
en: And there came Pharaoh and those before him and the overturned cities with sin.

source: فعصوا رسول ربهم فأخذهم أخذة رابية
en: And they disobeyed the messenger of their Lord, so He seized them with a seizure exceeding [in severity].

source: إنا لما طغى الماء حملناكم في الجارية
en: Indeed, when the water overflowed, We carried your ancestors in the sailing ship

source: لنجعلها لكم تذكرة وتعيها أذن واعية
en: That We might make it for you a reminder and [that] a conscious ear would be conscious of it.

source: فإذا نفخ في الصور نفخة واحدة
en: Then when the Horn is blown with one blast

source: وحملت الأرض والجبال فدكتا دكة واحدة
en: And the earth and the mountains are lifted and leveled with one blow -

source: فيومئذ وقعت الواقعة
en: Then on that Day, the Resurrection will occur,

source: وانشقت السماء فهي يومئذ واهية
en: And the heaven will split [open], for that Day it is infirm.

source: والملك على أرجائها ويحمل عرش ربك فوقهم يومئذ ثمانية
en: And the angels are at its edges. And there will bear the Throne of your Lord above them, that Day, eight [of them].

source: يومئذ تعرضون لا تخفى منكم خافية
en: That Day, you will be exhibited [for judgement]; not hidden among you is anything concealed.

source: فأما من أوتي كتابه بيمينه فيقول هاؤم اقرءوا كتابيه
en: So as for he who is given his record in his right hand, he will say, "Here, read my record!

source: إني ظننت أني ملاق حسابيه
en: Indeed, I was certain that I would be meeting my account."

source: فهو في عيشة راضية
en: So he will be in a pleasant life -

source: في جنة عالية
en: In an elevated garden,

source: قطوفها دانية
en: Its [fruit] to be picked hanging near.

source: كلوا واشربوا هنيئا بما أسلفتم في الأيام الخالية
en: [They will be told], "Eat and drink in satisfaction for what you put forth in the days past."

source: وأما من أوتي كتابه بشماله فيقول يا ليتني لم أوت كتابيه
en: But as for he who is given his record in his left hand, he will say, "Oh, I wish I had not been given my record

source: ولم أدر ما حسابيه
en: And had not known what is my account.

source: يا ليتها كانت القاضية
en: I wish my death had been the decisive one.

source: ما أغنى عني ماليه
en: My wealth has not availed me.

source: هلك عني سلطانيه
en: Gone from me is my authority."

source: خذوه فغلوه
en: [Allah will say], "Seize him and shackle him.

source: ثم الجحيم صلوه
en: Then into Hellfire drive him.

source: ثم في سلسلة ذرعها سبعون ذراعا فاسلكوه
en: Then into a chain whose length is seventy cubits insert him."

source: إنه كان لا يؤمن بالله العظيم
en: Indeed, he did not used to believe in Allah, the Most Great,

source: ولا يحض على طعام المسكين
en: Nor did he encourage the feeding of the poor.

source: فليس له اليوم هاهنا حميم
en: So there is not for him here this Day any devoted friend

source: ولا طعام إلا من غسلين
en: Nor any food except from the discharge of wounds;

source: لا يأكله إلا الخاطئون
en: None will eat it except the sinners.

source: فلا أقسم بما تبصرون
en: So I swear by what you see

source: وما لا تبصرون
en: And what you do not see

source: إنه لقول رسول كريم
en: [That] indeed, the Qur'an is the word of a noble Messenger.

source: وما هو بقول شاعر قليلا ما تؤمنون
en: And it is not the word of a poet; little do you believe.

source: ولا بقول كاهن قليلا ما تذكرون
en: Nor the word of a soothsayer; little do you remember.

source: ولو تقول علينا بعض الأقاويل
en: And if Muhammad had made up about Us some [false] sayings,

source: لأخذنا منه باليمين
en: We would have seized him by the right hand;

source: ثم لقطعنا منه الوتين
en: Then We would have cut from him the aorta.

source: فما منكم من أحد عنه حاجزين
en: And there is no one of you who could prevent [Us] from him.

source: وإنه لتذكرة للمتقين
en: And indeed, the Qur'an is a reminder for the righteous.

source: وإنا لنعلم أن منكم مكذبين
en: And indeed, We know that among you are deniers.

source: وإنه لحسرة على الكافرين
en: And indeed, it will be [a cause of] regret upon the disbelievers.

source: وإنه لحق اليقين
en: And indeed, it is the truth of certainty.

source: سأل سائل بعذاب واقع
en: A supplicant asked for a punishment bound to happen

source: للكافرين ليس له دافع
en: To the disbelievers; of it there is no preventer.

source: من الله ذي المعارج
en: [It is] from Allah, owner of the ways of ascent.

source: تعرج الملائكة والروح إليه في يوم كان مقداره خمسين ألف سنة
en: The angels and the Spirit will ascend to Him during a Day the extent of which is fifty thousand years.

source: فاصبر صبرا جميلا
en: So be patient with gracious patience.

source: إنهم يرونه بعيدا
en: Indeed, they see it [as] distant,
